<?php

namespace Database\Seeders;

use App\Models\User;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Spatie\Permission\Models\Role;

class DefaultUsers extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        $password = bcrypt(12345678);

        DB::table('users')->insert([
            ['id' => 1, 'username' => 'admin', 'password' => $password, 'name' => 'Super', 'family' => 'Admin', 'scientific_group' => null, 'type' => 1, 'subject' => 'ادمین کل', 'active' => 1, 'ntcp' => 0, 'adder' => 1],
            ['id' => 2, 'username' => 'farajnejad', 'password' => $password, 'name' => 'حسن', 'family' => 'فرج نژاد', 'scientific_group' => null, 'type' => 2, 'subject' => 'معاون', 'active' => 1, 'ntcp' => 0, 'adder' => 1],
            ['id' => 3, 'username' => 'mostafavizadeh', 'password' => $password, 'name' => 'حسین', 'family' => 'مصطفوی زاده', 'scientific_group' => null, 'type' => 3, 'subject' => 'مدیر پژوهش', 'active' => 1, 'ntcp' => 0, 'adder' => 1],
            ['id' => 4, 'username' => 'helali', 'password' => $password, 'name' => 'ابوالفضل', 'family' => 'هلالی', 'scientific_group' => null, 'type' => 4, 'subject' => 'مدیر نشر داخلی', 'active' => 1, 'ntcp' => 0, 'adder' => 1],
            ['id' => 5, 'username' => 'modirgp', 'password' => $password, 'name' => 'مدیر', 'family' => 'گروه علمی', 'scientific_group' => 1, 'type' => 5, 'subject' => 'مدیر گروه', 'active' => 1, 'ntcp' => 0, 'adder' => 1],
            ['id' => 6, 'username' => 'ozvgp', 'password' => $password, 'name' => 'عضو', 'family' => 'گروه', 'scientific_group' => 1, 'type' => 6, 'subject' => 'عضو گروه', 'active' => 1, 'ntcp' => 0, 'adder' => 1],
            ['id' => 7, 'username' => 'virastar', 'password' => $password, 'name' => 'ویراستار', 'family' => '1', 'scientific_group' => null, 'type' => 7, 'subject' => 'ویراستار', 'active' => 1, 'ntcp' => 0, 'adder' => 1],
            ['id' => 8, 'username' => 'tarrah', 'password' => $password, 'name' => 'طراح', 'family' => '1', 'scientific_group' => null, 'type' => 8, 'subject' => 'طراح', 'active' => 1, 'ntcp' => 0, 'adder' => 1],
            ['id' => 9, 'username' => 'safheara', 'password' => $password, 'name' => 'صفحه آرا', 'family' => '1', 'scientific_group' => null, 'type' => 9, 'subject' => 'صفحه آرا', 'active' => 1, 'ntcp' => 0, 'adder' => 1],
        ]);

        $createRole = Role::create(['name' => 'ادمین کل']);
        $createRole->givePermissionTo([
            'telescope',
            'لیست مقادیر اولیه',

            'لیست نقش',
            'ایجاد نقش',
            'ویرایش نقش',
            'حذف نقش',

            'لیست دسترسی',
            'ایجاد دسترسی',
            'ویرایش دسترسی',
            'نمایش جزئیات دسترسی',
            'حذف دسترسی',

            'لیست قالب اثر',
            'ایجاد قالب اثر',
            'ویرایش قالب اثر',
            'حذف قالب اثر',

            'لیست گروه علمی',
            'ایجاد گروه علمی',
            'ویرایش گروه علمی',
            'حذف گروه علمی',

            //internal publication
            'منوی نشر داخلی',
            'نشر داخلی - مدیریت آثار',
            'نشر داخلی - مدیریت آثار - اثر جدید',
            'نشر داخلی - مدیریت آثار - ویرایش اثر',
            'نشر داخلی - مدیریت آثار - نمایش تاریخچه',
            'نشر داخلی - مدیریت آثار - حذف اثر',

            'پژوهش - نمایش تاریخچه - ارسالی عضو گروه به مدیر گروه',
            'پژوهش - نمایش تاریخچه - ارسالی مدیر گروه به مدیر پژوهش',
            'پژوهش - نمایش تاریخچه - ارسالی مدیر گروه به عضو گروه',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر پژوهش به مدیر گروه',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر پژوهش به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی معاون به مدیر پژوهش',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به مدیر پژوهش',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به ویراستار',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به طراح',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به صفحه آرا',
            'نشر داخلی - نمایش تاریخچه - ارسالی ویراستار به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی طراح به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی صفحه آرا به مدیر نشر داخلی',
            'پژوهش - نمایش تاریخچه - ارسالی ادمین کل به مدیر گروه',
            'پژوهش - نمایش تاریخچه - ارسالی ادمین کل به عضو گروه',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به مدیر پژوهش',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به معاون',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به ویراستار',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به صفحه آرا',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به طراح',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به معاون',

            //Research
            'منوی پژوهش',
            'پژوهش - مدیریت آثار',
            'پژوهش - مدیریت آثار - اثر جدید',
            'پژوهش - مدیریت آثار - نمایش تاریخچه',

            'لیست کاربران',
            'ایجاد کاربر',
            'ویرایش کاربر',
            'تغییر وضعیت کاربر',
            'تغییر وضعیت نیازمند به تغییر رمز عبور',
            'بازنشانی رمز عبور کاربر',
            'لیست بکاپ دیتابیس',
            'ایجاد بکاپ دیتابیس',
        ]);

        $createRole = Role::create(['name' => 'معاون']);
        $createRole->givePermissionTo([
            'لیست مقادیر اولیه',

            'لیست نقش',
            'ویرایش نقش',

            'لیست قالب اثر',
            'ایجاد قالب اثر',
            'ویرایش قالب اثر',
            'حذف قالب اثر',

            'لیست گروه علمی',
            'ایجاد گروه علمی',
            'ویرایش گروه علمی',
            'حذف گروه علمی',

            //internal publication
            'منوی نشر داخلی',
            'نشر داخلی - مدیریت آثار',
            'نشر داخلی - مدیریت آثار - اثر جدید',
            'نشر داخلی - مدیریت آثار - ویرایش اثر',
            'نشر داخلی - مدیریت آثار - نمایش تاریخچه',
            'نشر داخلی - مدیریت آثار - حذف اثر',

            'پژوهش - نمایش تاریخچه - ارسالی عضو گروه به مدیر گروه',
            'پژوهش - نمایش تاریخچه - ارسالی مدیر گروه به مدیر پژوهش',
            'پژوهش - نمایش تاریخچه - ارسالی مدیر گروه به عضو گروه',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر پژوهش به مدیر گروه',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر پژوهش به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی معاون به مدیر پژوهش',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به مدیر پژوهش',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به ویراستار',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به طراح',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به صفحه آرا',
            'نشر داخلی - نمایش تاریخچه - ارسالی ویراستار به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی طراح به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی صفحه آرا به مدیر نشر داخلی',
            'پژوهش - نمایش تاریخچه - ارسالی ادمین کل به مدیر گروه',
            'پژوهش - نمایش تاریخچه - ارسالی ادمین کل به عضو گروه',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به مدیر پژوهش',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به معاون',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به ویراستار',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به صفحه آرا',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به طراح',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به معاون',
            'نشر داخلی - نمایش تاریخچه - ارسالی معاون به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر پژوهش به معاون',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به معاون',

            'لیست کاربران',
            'ایجاد کاربر',
            'ویرایش کاربر',
            'تغییر وضعیت کاربر',
            'تغییر وضعیت نیازمند به تغییر رمز عبور',
            'بازنشانی رمز عبور کاربر',
        ]);

        $createRole = Role::create(['name' => 'مدیر پژوهش']);
        $createRole->givePermissionTo([
            'لیست مقادیر اولیه',

            'لیست نقش',
            'ویرایش نقش',

            'لیست قالب اثر',
            'ایجاد قالب اثر',
            'ویرایش قالب اثر',
            'حذف قالب اثر',

            'لیست گروه علمی',
            'ایجاد گروه علمی',
            'ویرایش گروه علمی',
            'حذف گروه علمی',

            //internal publication
            'منوی نشر داخلی',
            'نشر داخلی - مدیریت آثار',
            'نشر داخلی - مدیریت آثار - اثر جدید',
            'نشر داخلی - مدیریت آثار - ویرایش اثر',
            'نشر داخلی - مدیریت آثار - نمایش تاریخچه',
            'نشر داخلی - مدیریت آثار - حذف اثر',

            'پژوهش - نمایش تاریخچه - ارسالی عضو گروه به مدیر گروه',
            'پژوهش - نمایش تاریخچه - ارسالی مدیر گروه به مدیر پژوهش',
            'پژوهش - نمایش تاریخچه - ارسالی مدیر گروه به عضو گروه',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر پژوهش به مدیر گروه',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر پژوهش به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی معاون به مدیر پژوهش',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به مدیر پژوهش',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به ویراستار',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به طراح',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به صفحه آرا',
            'نشر داخلی - نمایش تاریخچه - ارسالی ویراستار به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی طراح به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی صفحه آرا به مدیر نشر داخلی',
            'پژوهش - نمایش تاریخچه - ارسالی ادمین کل به مدیر گروه',
            'پژوهش - نمایش تاریخچه - ارسالی ادمین کل به عضو گروه',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به مدیر پژوهش',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به معاون',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به ویراستار',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به صفحه آرا',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به طراح',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به معاون',

            'لیست کاربران',
            'ایجاد کاربر',
            'ویرایش کاربر',
            'تغییر وضعیت کاربر',
            'تغییر وضعیت نیازمند به تغییر رمز عبور',
            'بازنشانی رمز عبور کاربر',
        ]);


        $createRole = Role::create(['name' => 'مدیر نشر داخلی']);
        $createRole->givePermissionTo([
            'منوی نشر داخلی',
            'نشر داخلی - مدیریت آثار',
            'نشر داخلی - مدیریت آثار - نمایش تاریخچه',

            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر پژوهش به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به مدیر پژوهش',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به ویراستار',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به طراح',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به صفحه آرا',
            'نشر داخلی - نمایش تاریخچه - ارسالی ویراستار به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی طراح به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی صفحه آرا به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به صفحه آرا',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به ویراستار',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به طراح',
        ]);

        $createRole = Role::create(['name' => 'مدیر گروه']);
        $createRole->givePermissionTo([
            'منوی پژوهش',
            'پژوهش - مدیریت آثار',
            'پژوهش - مدیریت آثار - اثر جدید',
            'پژوهش - مدیریت آثار - نمایش تاریخچه',

            'پژوهش - نمایش تاریخچه - ارسالی مدیر گروه به مدیر پژوهش',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر پژوهش به مدیر گروه',
            'پژوهش - نمایش تاریخچه - ارسالی عضو گروه به مدیر گروه',
            'پژوهش - نمایش تاریخچه - ارسالی مدیر گروه به عضو گروه',
        ]);

        $createRole = Role::create(['name' => 'عضو گروه']);
        $createRole->givePermissionTo([
            'منوی پژوهش',
            'پژوهش - مدیریت آثار',
            'پژوهش - مدیریت آثار - اثر جدید',
            'پژوهش - مدیریت آثار - نمایش تاریخچه',

            'پژوهش - نمایش تاریخچه - ارسالی عضو گروه به مدیر گروه',
            'پژوهش - نمایش تاریخچه - ارسالی مدیر گروه به عضو گروه',
        ]);

        $createRole = Role::create(['name' => 'ویراستار']);
        $createRole->givePermissionTo([
            'منوی نشر داخلی',
            'نشر داخلی - مدیریت آثار',
            'نشر داخلی - مدیریت آثار - نمایش تاریخچه',

            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به ویراستار',
            'نشر داخلی - نمایش تاریخچه - ارسالی ویراستار به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به ویراستار',
        ]);

        $createRole = Role::create(['name' => 'طراح']);
        $createRole->givePermissionTo([
            'منوی نشر داخلی',
            'نشر داخلی - مدیریت آثار',
            'نشر داخلی - مدیریت آثار - نمایش تاریخچه',

            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به طراح',
            'نشر داخلی - نمایش تاریخچه - ارسالی طراح به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به طراح',
        ]);

        $createRole = Role::create(['name' => 'صفحه آرا']);
        $createRole->givePermissionTo([
            'منوی نشر داخلی',
            'نشر داخلی - مدیریت آثار',
            'نشر داخلی - مدیریت آثار - نمایش تاریخچه',

            'نشر داخلی - نمایش تاریخچه - ارسالی ادمین کل به صفحه آرا',
            'نشر داخلی - نمایش تاریخچه - ارسالی صفحه آرا به مدیر نشر داخلی',
            'نشر داخلی - نمایش تاریخچه - ارسالی مدیر نشر داخلی به صفحه آرا',
        ]);

        $role = Role::where('name', 'ادمین کل')->first();
        $user = User::find(1);
        $user->assignRole([$role->id]);

        $role = Role::where('name', 'مدیر پژوهش')->first();
        $user = User::find(3);
        $user->assignRole([$role->id]);

        $role = Role::where('name', 'معاون')->first();
        $user = User::find(2);
        $user->assignRole([$role->id]);

        $role = Role::where('name', 'مدیر نشر داخلی')->first();
        $user = User::find(4);
        $user->assignRole([$role->id]);

        $role = Role::where('name', 'مدیر گروه')->first();
        $user = User::find(5);
        $user->assignRole([$role->id]);

        $role = Role::where('name', 'عضو گروه')->first();
        $user = User::find(6);
        $user->assignRole([$role->id]);

        $role = Role::where('name', 'ویراستار')->first();
        $user = User::find(7);
        $user->assignRole([$role->id]);

        $role = Role::where('name', 'طراح')->first();
        $user = User::find(8);
        $user->assignRole([$role->id]);

        $role = Role::where('name', 'صفحه آرا')->first();
        $user = User::find(9);
        $user->assignRole([$role->id]);
    }
}
